Revit 2024 API
ParameterTypeId.BoundaryZRotationFixed Property
 "Z Rotation - Fixed"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId BoundaryZRotationFixed { get; }
Visual Basic
Public Shared ReadOnly Property BoundaryZRotationFixed As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ BoundaryZRotationFixed {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace